ducasp/ESP32-UNAPI-Firmware/UNAPIESP.h
/*
UNAPIESP.h
    ESP32 UNAPI Implementation.
    Revision 1.00

Requires Arduino IDE and ESP32 libraries

Copyright (c) 2019 - 2026 Oduvaldo Pavan Junior ( ducasp@ gmail.com )
Copyright (c) 2026 - Leo Manes ( https://github.com/leomanes )
All rights reserved.

HTTP functionality
Copyright (c) 2025 Jeroen Taverne
All rights reserved.

If you integrate this on your hardware, please consider the 
possibility of sending one piece of it as a thank you to the author :)
Of course this is not mandatory, if you like the idea, contact the
author in the e-mail address above.

This file, that is part of ESP8266 UNAPI Firmware program, is free
software: you can redistribute it and/or modify it under the terms
of the GNU Lesser General Public License as published by the Free
Software Foundation, either version 2.1 of the License, or (at your
option) any later version.

This file is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this file.  If not, see <https://www.gnu.org/licenses/>
*/

#ifndef _UNAPIESP_H
#define _UNAPIESP_H

#define MAX_CMD_DATA_LEN 2148
#include "ESP32BOARDS.h"

struct ESPConfig {
  unsigned char ucConfigFileName[8];
  unsigned char ucStructVersion;
  unsigned char ucNagle;
  unsigned char ucAlwaysOn;
  unsigned int uiRadioOffTimer;
  unsigned char ucAutoClock;
  int iGMT;
  unsigned char ucBaudRate;
  unsigned char ucAutoUpdateFH;
};

enum CommandTypes {
  NO_COMMAND = 0,
  QUICK_COMMAND = 1,
  REGULAR_COMMAND = 2
};

enum RxDataParserStates {
  RX_PARSER_IDLE = 0,
  RX_PARSER_WAIT_DATA_SIZE,
  RX_PARSER_GET_DATA,
  RX_PARSER_PROCCESS_CMD
};

enum ConnectionStates {
  CONN_CLOSED = 0,
  CONN_UDP = 1,
  CONN_TCP_ACTIVE = 2,
  CONN_TCP_PASSIVE = 3,
  CONN_TCP_TLS_A = 4,
  CONN_SSH = 5
};

// IMPORTANT!!!!
// Never add any custom function lower than ' ' (0x20) or higher than DEL (0x7F)
// Command ranges 0x00 to 0x19 are reserved for TCP-IP UNAPI commands
// Command ranges 0x7F to 0xFF are reserved for SSH UNAPI commands and additional TCP-IP UNAPI commands not in spec (i.e.: http client)
enum CustomFunctions {
  CUSTOM_F_RESET = 'R',
  CUSTOM_F_RETRY_TX = 'r',
  CUSTOM_F_SCAN = 'S',
  CUSTOM_F_SCAN_R = 's',
  CUSTOM_F_CONNECT_AP = 'A',
  CUSTOM_F_CLEAR_AP = 'a',
  CUSTOM_F_GETBOARD = 'b',
  CUSTOM_F_FILE_BOARD = 'B',
  CUSTOM_F_SETBAUD = 'd',
  CUSTOM_F_UPDATE_FW = 'U',
  CUSTOM_F_UPDATE_CERTS = 'u',
  CUSTOM_F_GET_VER = 'V',
  CUSTOM_F_START_RS232_UPDATE = 'Z',
  CUSTOM_F_START_RS232_CERT_UPDATE = 'Y',
  CUSTOM_F_BLOCK_RS232_UPDATE = 'z',
  CUSTOM_F_END_RS232_UPDATE = 'E',
  CUSTOM_F_NO_DELAY = 'N',
  CUSTOM_F_DELAY = 'D',
  CUSTOM_F_INITCERTS = 'I',
  CUSTOM_F_WIFI_ON_TIMER_SET = 'T',
  CUSTOM_F_TURN_WIFI_OFF = 'O',
  CUSTOM_F_TURN_RS232_OFF = 'o',
  CUSTOM_F_QUERY_SETTINGS = 'Q',
  CUSTOM_F_QUERY_AUTOCLOCK = 'c',
  CUSTOM_F_SET_AUTOCLOCK = 'C',
  CUSTOM_F_GET_DATETIME = 'G',
  CUSTOM_F_WARMBOOT = 'W',
  CUSTOM_F_HOLDCONNECTION = 'H',
  CUSTOM_F_RELEASECONNECTION = 'h',
  CUSTOM_F_GETAPSTS = 'g',
  CUSTOM_F_QUERY = '?'
};

// MUST NEVER GO BEYOND 33 for standard TCP-IP UNAPI functions
// MUST NEVER BE BELOW 129 for standard SSH UNAPI functions OR extended TCP-IP UNAPI functions
enum TcpipUnapiFunctions {
  TCPIP_GET_CAPAB = 1,
  TCPIP_GET_IPINFO = 2,
  TCPIP_NET_STATE = 3,
  TCPIP_SEND_ECHO = 4,
  TCPIP_RCV_ECHO = 5,
  TCPIP_DNS_Q = 6,
  TCPIP_DNS_Q_NEW = 206,
  TCPIP_DNS_S = 7,
  TCPIP_UDP_OPEN = 8,
  TCPIP_UDP_CLOSE = 9,
  TCPIP_UDP_STATE = 10,
  TCPIP_UDP_SEND = 11,
  TCPIP_UDP_RCV = 12,
  TCPIP_TCP_OPEN = 13,
  TCPIP_TCP_CLOSE = 14,
  TCPIP_TCP_ABORT = 15,
  TCPIP_TCP_STATE = 16,
  TCPIP_TCP_SEND = 17,
  TCPIP_TCP_RCV = 18,
  TCPIP_TCP_FLUSH = 19,
  TCPIP_RAW_OPEN = 20,
  TCPIP_RAW_CLOSE = 21,
  TCPIP_RAW_STATE = 22,
  TCPIP_RAW_SEND = 23,
  TCPIP_RAW_RCV = 24,
  TCPIP_CONFIG_AUTOIP = 25,
  TCPIP_CONFIG_IP = 26,
  TCPIP_CONFIG_TTL = 27,
  TCPIP_CONFIG_PING = 28,
  TCPIP_WAIT = 29,
  TCPIP_HTTP_OPEN = 200,
  TCPIP_HTTP_RECEIVE = 201,
  TCPIP_HTTP_CLOSE = 202
};

// MUST NEVER GO BEYOND 33 for standard TCP-IP UNAPI functions
// MUST NEVER BE BELOW 129 for standard SSH UNAPI functions OR extended TCP-IP UNAPI functions
enum SshUnapiFunctions {
  SSH_GET_CAPAB = 129,
  SSH_OPEN = 130,
  SSH_CLOSE = 131,
  SSH_STATE = 132,
  SSH_SEND = 133,
  SSH_RCV = 134,
  SSH_TERM_TYPE = 135,
  SSH_WIN_SIZE = 136
};

enum TcpipUnapiGetCapabParam1
{
  TCPIP_GET_CAPAB_FLAGS = 1,
  TCPIP_GET_CAPAB_CONN = 2,
  TCPIP_GET_CAPAB_DGRAM = 3,
  TCPIP_GET_SECONDARY_CAPAB_FLAGS = 4
};

enum TcpipUnapiGetIpInfoParam1
{
  TCPIP_GET_IPINFO_LOCALIP = 1,
  TCPIP_GET_IPINFO_PEERIP = 2,
  TCPIP_GET_IPINFO_SUBNETMASK = 3,
  TCPIP_GET_IPINFO_GATEWAY = 4,
  TCPIP_GET_IPINFO_PRIMDNS = 5,
  TCPIP_GET_IPINFO_SECDNS = 6
};

enum TcpipErrorCodes {
  UNAPI_ERR_OK = 0,
  UNAPI_ERR_NOT_IMP,
  UNAPI_ERR_NO_NETWORK,
  UNAPI_ERR_NO_DATA,
  UNAPI_ERR_INV_PARAM,
  UNAPI_ERR_QUERY_EXISTS,
  UNAPI_ERR_INV_IP,
  UNAPI_ERR_NO_DNS,
  UNAPI_ERR_DNS,
  UNAPI_ERR_NO_FREE_CONN,
  UNAPI_ERR_CONN_EXISTS,
  UNAPI_ERR_NO_CONN,
  UNAPI_ERR_CONN_STATE,
  UNAPI_ERR_BUFFER,
  UNAPI_ERR_LARGE_DGRAM,
  UNAPI_ERR_INV_OPER
};

enum SSHErrorCodes {
  SSH_ERR_NO_RSS = 127,
  SSH_ERR_INV_KEY,
  SSH_ERR_PWD,
  SSH_ERR_PTY_REQ
};

enum SshConnectionStates {
  SSH_CLOSED = 0,
  SSH_CONNECTING = 1,
  SSH_AUTHENTICATING = 2,
  SSH_CONNECTED = 3,
  SSH_ERROR = 4
};

enum SshTerminalTypes {
  TERM_VT52 = 0,
  TERM_ANSI = 1,
  TERM_XTERM = 2
};

enum SshSubsystems {
  SSH_SUB_PTY = 0,
  SSH_SUB_SFTP = 1,
  SSH_SUB_SCP = 2,
  SSH_SUB_RAW = 4
};

#define SSH_AUTH_PASSWORD  0
#define SSH_AUTH_PUBKEY    1

#endif
